[
    {
        "title": "Ancho-Orange Chicken",
        "subtitle": "with Kale Rice & Roasted Carrots",
        "description": "Weʼre amping up chicken breasts with a glaze of smoky ancho chile paste and fresh orange juice in this recipe. On the side, roasted carrots and lightly creamy, golden raisin-studded rice perfectly accent the sweetness of the glaze.",
        "ingredients": [
            "4 Boneless, Skinless Chicken Breasts", 
            "1 Tbsp Ancho Chile Paste", 
            "2 Tbsps Crème Fraîche", 
            "3 Tbsps Golden Raisins"
        ],
        "kitchen_tools": {
            "name": "Garlic Press",
            "description": "Slicing garlic has never been simpler. This two-sided essential is designed to do two jobs in one: crush garlic and slice it. Made by Harold Import Company, a family-owned American business with over 50 years of experience, this easy-to-use press owes its incredible durability to its heavyweight, stainless steel construction. To use it, simply place the clove in the hopper and press downward for freshly pressed garlic, or flip it over to get uniform slices of garlic. And to ensure minimal mess, it includes a handy cleaning tool for removing leftover pressed garlic after use."
        },
        "steps": [
            {
                "title": null,
                "content": "Place an oven rack in the center of the oven, then preheat to 450°F. In a medium pot, combine the rice, a big pinch of salt, and 1 1/2 cups of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Turn off the heat and fluff with a fork. Cover to keep warm."
            },
            {
                "title": "Prepare the ingredients & make the glaze",
                "content": "While the rice cooks, wash and dry the fresh produce. Peel the carrots; quarter lengthwise, then halve crosswise. Peel and roughly chop the garlic. Remove and discard the stems of the kale; finely chop the leaves. Using a peeler, remove the lime rind, avoiding the white pith; mince to get 2 teaspoons of zest (or use a zester). Halve the lime crosswise. Halve the orange; squeeze the juice into a bowl, straining out any seeds. Whisk in the chile paste and 2 tablespoons of water until smooth."
            },
            {
                "title": null,
                "content": "Place the sliced carrots on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer. Roast 15 to 17 minutes, or until tender when pierced with a fork. Remove from the oven."
            },
            {
                "title": null,
                "content": "While the carrots roast, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the chopped garlic and cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the chopped kale; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until slightly wilted. Add 1/3 cup of water; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until the kale has wilted and the water has cooked off. Transfer to the pot of cooked rice. Stir to combine; season with salt and pepper to taste. Cover to keep warm. Wipe out the pan."
            },
            {
                "title": "Cook & glaze the chicken",
                "content": "While the carrots continue to roast, pat the chicken dry with paper towels; season with salt and pepper on both sides. In the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned chicken and cook 4 to 6 minutes on the first side, or until browned. Flip and cook 2 to 3 minutes, or until lightly browned. Add the glaze and cook, frequently spooning the glaze over the chicken, 2 to 3 minutes, or until the chicken is coated and cooked through. Turn off the heat; stir the butter and the juice of 1 lime half into the glaze until the butter has melted. Season with salt and pepper to taste."
            },
            {
                "title": "Finish the rice & serve your dish",
                "content": "To the pot of cooked rice and kale, add the lime zest, crème fraîche, raisins, and the juice of the remaining lime half. Stir to combine; season with salt and pepper to taste. Serve the glazed chicken with the finished rice and roasted carrots. Top the chicken with the remaining glaze from the pan. Enjoy!"
            }
        ]
    },
    {
        "title": "Beef Medallions & Mushroom Sauce",
        "subtitle": "with Mashed Potatoes",
        "description": "In this easy recipe, inspired by steak Diane (an American restaurant classic), weʼre searing beef medallions, then using the fond in the pan to make a rich, bright mushroom sauce for spooning on top. Garlic mashed potatoes and sautéed kale make for delicious, simple sides.",
        "ingredients": [
            "4 oz Cremini Mushrooms",
            "3/4 lb Yukon Gold Potatoes"
        ],
        "kitchen_tools": {
            "name": "Slotted Spatula",
            "description": "Master your flipping skills with this commercial-grade slotted turner. This spatula is designed for delicate fish, but we use this versatile tool for anything that requires a deft hand for tricky flipping, such as over-easy eggs, paper-thin crepes or even a burger. With its low-angled beveled edge and flexible blade, this turner slips easily between the pan and your dinner, ensuring even the most delicate meal remains in picture-perfect condition."
        },
        "steps": [
            {
                "title": "Prepare the ingredients",
                "content": "Heat a medium pot of salted water to boiling on high. Wash and dry the fresh produce. Large dice the potatoes. Peel the garlic. Using the flat side of your knife, smash 1 clove to flatten. Roughly chop the remaining clove. Peel and thinly slice the shallot. Remove and discard the stems of the kale; roughly chop the leaves. Thinly slice the mushrooms."
            },
            {
                "title": "Cook & mash the potatoes",
                "content": "Add the diced potatoes and smashed garlic to the pot of boiling water and cook 13 to 15 minutes, or until tender when pierced with a fork. Turn off the heat. Drain thoroughly and return to the pot. Add half the butter and a drizzle of olive oil. Using a fork, mash to your desired consistency. Season with salt and pepper to taste. Cover to keep warm."
            },
            {
                "title": null,
                "content": "While the potatoes cook, in a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the sliced shallot; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened. Add the chopped kale and 1/4 cup of water; season with salt and pepper. Cook, stirring frequently, 3 to 4 minutes, or until the kale has wilted and the water has cooked off. Transfer to a bowl and season with salt and pepper to taste. Cover with aluminum foil to keep warm. Rinse and wipe out the pan."
            },
            {
                "title": null,
                "content": "While the potatoes continue to cook, pat the beef dry with paper towels. Season with salt and pepper on both sides. In the same pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned beef and cook 2 to 3 minutes per side for medium-rare, or until browned and cooked to your desired degree of doneness. Leaving any browned bits (or fond) in the pan, transfer to a plate and let rest for at least 5 minutes."
            },
            {
                "title": "Make the mushroom sauce",
                "content": "While the beef rests, add a drizzle of olive oil to the pan of reserved fond and heat on medium-high until hot. Add the sliced mushrooms in an even layer. Cook, without stirring, 2 to 3 minutes, or until browned. Add the chopped garlic; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until softened and fragrant. Add the mustard, verjus, and 2 tablespoons of water (be careful, as the liquid may splatter); season with salt and pepper. Cook, stirring frequently and scraping up any fond, 30 seconds to 1 minute, or until thoroughly combined. Turn off the heat and stir in the remaining butter until melted. (If the sauce seems too thick, gradually add up to 2 tablespoons of water to achieve your desired consistency.) Season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "Serve the rested beef with the mashed potatoes and cooked kale. Top the beef and potatoes with the mushroom sauce. Enjoy!"
            }
        ]
    },
    {
        "title": "Broccoli & Basil Pesto Sandwiches",
        "subtitle": "with Romaine & Citrus Salad",
        "description": "These Italian focaccia sandwiches are layered with broccoli, three cheeses, and a savory basil, cashew, and pine nut pesto, then baked in the oven to meld all the bright, aromatic flavors. On the side, weʼre serving a refreshing salad of romaine and seasonal clementine, dressed in a creamy dressing made with fresh clementine juice.",
        "ingredients": [
            "1 Piece Focaccia Bread",
            "1 8-Ounce Can Tomato Sauce",
            "1/2 lb Fresh Mozzarella Cheese",
            "2 Clementines",
            "2 cloves Garlic",
            "2 Romaine Lettuce Hearts",
            "1 lb Broccoli",
            "1 oz Golden Or Red Sweet Piquante Peppers",
            "2 Tbsps Crème Fraîche",
            "1 Tbsp Dijon Mustard",
            "1/2 cup Basil & Cashew Pesto (Contains Pine Nuts)",
            "1/3 cup Shaved Parmesan Cheese",
            "1 Tbsp Italian Seasoning (Whole Dried Basil, Sage, Oregano, Savory, Rosemary, Thyme, & Marjoram)"
        ],
        "kitchen_tools": {
            "name": "Large Maple Cutting Board by John Boos & Co. for Blue Apron",
            "description": "Built to last, this chopping board is prized by professional chefs and so gorgeous we never want to take it off the counter. Crafted with hardy American maple, this exclusive collaboration between Blue Apron and John Boos & Co. is equal parts beautiful and handy. Its durable surface wonʼt warp and is resistant to scoring; magically, it also helps keep your blades sharper than other materials. Youʼll find these boards in our test kitchen—as well as professional kitchens around the world."
        },
        "steps": [
            {
                "title": "Prepare the ingredients & season the tomato sauce",
                "content": "Place an oven rack in the center of the oven, then preheat to 475°F. Wash and dry the fresh produce. Cut off and discard the bottom 1/2 inch of the broccoli stem; cut the broccoli into small pieces, keeping the florets intact. Peel and roughly chop the garlic. Halve the focaccia. Grate the asiago cheese on the large side of a box grater. Tear the mozzarella cheese into small pieces. In a bowl, combine the tomato sauce and Italian seasoning; season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the broccoli pieces; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until slightly softened. Add the chopped garlic; cook, stirring frequently, 1 to 2 minutes, or until slightly softened and fragrant. Add 1/2 cup of water; season with salt and pepper. Cook, stirring occasionally, 4 to 5 minutes, or until the broccoli has softened and the water has cooked off. Turn off the heat."
            },
            {
                "title": "Top & bake the focaccia",
                "content": "Line a sheet pan with foil. Place the halved focaccia on the foil, cut side up; drizzle with olive oil. Top with the seasoned tomato sauce. Top the focaccia bottom with the grated asiago cheese, half the mozzarella cheese, and the cooked broccoli. Evenly top the broccoli with the remaining mozzarella cheese and pesto (stirring before adding). Season both focaccia halves with salt and pepper. Bake, rotating the sheet pan halfway through, 11 to 13 minutes, or until lightly browned and the cheese has melted. Remove from the oven; let stand for at least 2 minutes. Transfer to a cutting board."
            },
            {
                "title": "Prepare the remaining ingredients",
                "content": "While the focaccia bakes, cut off and discard the root end of the lettuce; roughly chop the leaves. Place in a large bowl. Roughly chop the peppers. Halve 1 clementine crosswise; squeeze the juice into a bowl, straining out any seeds. Peel the remaining clementine; separate into segments. To make the dressing, add the crème fraîche, mustard, and 1 tablespoon of water to the bowl of clementine juice. Slowly whisk in a drizzle of olive oil until combined; season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "Just before serving, add the clementine segments, chopped peppers, and dressing to the bowl of chopped lettuce. Toss to thoroughly coat. Season with salt and pepper to taste."
            },
            {
                "title": "Assemble the sandwich & serve your dish",
                "content": "Evenly top the baked focaccia bottom with the parmesan cheese. Complete with the focaccia top. Using a serrated knife, cut the finished sandwich into 4 equal-sized pieces. Serve with the salad on the side. Enjoy!"
            }
        ]
    },
    {
        "title": "Broccoli & Mozzarella Calzones",
        "subtitle": "with Caesar Salad",
        "description": "These calzones are loaded with melty fresh mozzarella, creamy ricotta, and tender broccoli—balanced by a tangy tomato dipping sauce. For a refreshing side, weʼre tossing crunchy romaine and briny black olives in our take on Caesar dressing.",
        "ingredients": [
            "1 1/2 lbs Pizza Dough",
            "3 cloves Garlic",
            "1 Romaine Lettuce Heart",
            "1 lb Broccoli",
            "1 cup Part-Skim Ricotta Cheese",
            "1 8-Ounce Can Tomato Sauce",
            "1/2 lb Fresh Mozzarella Cheese",
            "1/4 cup Grated Parmesan Cheese",
            "2 oz Black Cerignola Olives",
            "1 Tbsp Italian Seasoning (Whole Dried Basil, Sage, Oregano, Savory, Rosemary, Thyme, & Marjoram)",
            "1 Lemon"
        ],
        "kitchen_tools": {
            "name": "Olive Wood Spoon by Eddington",
            "description": "Stir some old-world charm into your next meal with this sturdy spoon made from Italian-grown olive wood. For home cooks and professional chefs alike, this multi-purpose 14” blunt-end spoon is a must-have item. Stain and odor resistant, this spoon will not scratch porcelain, ceramic, glass, or enamel surfaces, and wonʼt heat up while you stir. Each unique olive wood spoon brings a sense of quality and professionalism to even the simplest tasks, like stirring sauce or deglazing a pan."
        },
        "steps": [
            {
                "title": "Prepare the ingredients",
                "content": "Remove the dough from the refrigerator to bring to room temperature. Place an oven rack in the center of the oven, then preheat to 475°F. Wash and dry the fresh produce. Cut off and discard the bottom 1/2 inch of the broccoli stem, then roughly chop the broccoli. Peel and roughly chop the garlic. Tear the mozzarella cheese into small pieces. Quarter and deseed the lemon."
            },
            {
                "title": "Cook the broccoli & make the filling",
                "content": "In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the chopped broccoli; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until lightly browned. Add 2/3 of the chopped garlic. Cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add 1/4 cup of water; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until the broccoli has softened and the water has cooked off. Transfer to a large bowl. Add the mozzarella cheese, ricotta cheese, half the Italian seasoning, and the juice of 1 lemon wedge; stir to combine. Season with salt and pepper. Wipe out the pan."
            },
            {
                "title": "Assemble & bake the calzones",
                "content": "Lightly oil a sheet pan. Divide the dough into 2 equal-sized portions; using your hands and a rolling pin (or wine bottle), gently stretch and roll the portions into ¼-inch-thick rounds. (If the dough is resistant, let rest for 5 minutes.) Divide the filling between the centers of the rounds; fold each round in half over the filling. Using a fork, crimp the edges of the dough to seal. Transfer to the sheet pan. Using a fork, poke a few holes across the tops of the calzones to vent. Lightly drizzle the calzones with olive oil. Bake 16 to 18 minutes, or until golden brown. Transfer to a cutting board and let stand for at least 2 minutes."
            },
            {
                "title": "Prepare the remaining ingredients",
                "content": "While the calzones bake, using the flat side of your knife, smash the olives; remove and discard the pits, then roughly chop. Cut off and discard the root end of the lettuce; roughly chop the leaves. To make the dressing, in a large bowl, combine the mayonnaise, half the parmesan cheese, the juice of the remaining lemon wedges, and a drizzle of olive oil. Season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "While the calzones continue to bake, in the pan used to cook the broccoli, heat 2 teaspoons of olive oil on medium-high until hot. Add the remaining chopped garlic; cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the tomato sauce and remaining Italian seasoning. Cook, stirring frequently, 2 to 3 minutes, or until slightly thickened. Turn off the heat and season with salt and pepper to taste."
            },
            {
                "title": "Make the salad & serve your dish",
                "content": "Just before serving, add the chopped olives and lettuce to the bowl of dressing. Toss to coat; season with salt and pepper to taste. Cut the baked calzones in half. Serve with the sauce and salad on the side. Garnish with the remaining parmesan cheese. Enjoy!"
            }
        ]
    },
    {
        "title": "Bucatini Alfredo",
        "subtitle": "with Broccoli",
        "description": "This quick-cooking recipe captures all the deliciously creamy, rich flavor of the classic Italian-American sauce—with the welcome addition of quick-braised broccoli. A dusting of pecorino cheese completes each bowl with a touch of sharpness.",
        "ingredients": [
            "2 Tbsps Crème Fraîche",
            "1/4 tsp Crushed Red Pepper Flakes",
            "3 Tbsps All-Purpose Flour",
            "1/4 cup Grated Pecorino Cheese"
        ],
        "kitchen_tools": {
            "name": "Stainless Steel Strainer",
            "description": "A stainless steel strainer is a handy tool for quinoa. It's great for draining grains and pastas (not to mention small fruits and vegetables after washing) and straining stocks and gravy. Lightweight and sturdy, itʼs constructed with a double-fine mesh."
        },
        "steps": [
            {
                "title": "Prepare the ingredients",
                "content": "Heat a large pot of salted water to boiling on high. Wash and dry the fresh produce. Cut off and discard the bottom 1/2 inch of the broccoli stem; cut the broccoli into small pieces, keeping the florets intact. Peel and finely chop the garlic."
            },
            {
                "title": "Cook the broccoli",
                "content": "In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the broccoli pieces; season with salt and pepper. Cook, stirring occasionally, 4 to 5 minutes, or until slightly softened. Add 1/2 cup of water; season with salt and pepper. Cover the pan with aluminum foil and cook 3 to 4 minutes, or until the broccoli has softened and the water has cooked off. Transfer to a bowl. Wipe out the pan."
            },
            {
                "title": null,
                "content": "While the broccoli cooks, add the pasta to the pot of boiling water and cook 8 to 10 minutes, or until al dente (still slightly firm to the bite). Reserving 1/2 cup of the pasta cooking water, drain thoroughly."
            },
            {
                "title": null,
                "content": "In the same pan, heat 1 1/2 tablespoons of olive oil on medium-high until hot. Add the chopped garlic; season with salt and pepper. Cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the flour and as much of the red pepper flakes as you’d like, depending on how spicy you’d like the dish to be. Cook, stirring constantly, 30 seconds to 1 minute, or until thoroughly combined. Add the heavy cream (shaking the bottle just before opening), verjus, and 1 1/4 cups of water; season with salt and pepper. Cook, whisking frequently, 2 to 3 minutes, or until thickened; season with salt and pepper to taste."
            },
            {
                "title": "Finish & serve your dish",
                "content": "Add the cooked pasta, cooked broccoli, crème fraîche, and half the reserved pasta cooking water to the pan. Cook, stirring vigorously, 30 seconds to 1 minute, or until the pasta is thoroughly coated. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Turn off the heat and season with salt and pepper to taste. Garnish the finished pasta with the cheese; season with pepper. Enjoy!"
            }
        ]
    },
    {
        "title": "Bucatini & Tomato Sauce",
        "subtitle": "with Roasted Broccoli",
        "description": "Made with petite datterini tomatoes, the sauce for tonightʼs bucatini highlights briny olives and capers, hot red pepper flakes, and savory Grana Padano cheese. Weʼre mixing in roasted broccoli for contrasting texture and nutty-sweet flavor.",
        "ingredients": [
            "6 oz Bucatini Pasta",
            "1 14-Ounce Can Datterini Tomatoes",
            "2 cloves Garlic",
            "2 Tbsps Butter",
            "1 Tbsp Capers",
            "1 lb Broccoli",
            "3/4 oz Grana Padano Cheese",
            "1 oz Kalamata Olives",
            "1/4 tsp Crushed Red Pepper Flakes",
            "1 Tbsp Italian Seasoning (Whole Dried Basil, Sage, Oregano, Savory, Rosemary, Thyme, & Marjoram)"
        ],
        "kitchen_tools": {
            "name": "Stainless Steel Strainer",
            "description": "A stainless steel strainer is a handy tool for quinoa. It's great for draining grains and pastas (not to mention small fruits and vegetables after washing) and straining stocks and gravy. Lightweight and sturdy, itʼs constructed with a double-fine mesh."
        },
        "steps": [
            {
                "title": "Prepare & roast the broccoli",
                "content": "Place an oven rack in the center of the oven, then preheat to 450°F. Heat a large pot of salted water to boiling on high. Wash and dry the fresh produce. Cut off and discard the bottom 1/2 inch of the broccoli stem; cut the broccoli into small pieces. Place on a sheet pan. Drizzle with olive oil and season with salt, pepper, and up to half the Italian seasoning (you will have extra); toss to coat. Arrange in an even layer. Roast 22 to 24 minutes, or until browned and tender when pierced with a fork. Remove from the oven."
            },
            {
                "title": "Prepare the remaining ingredients",
                "content": "While the broccoli roasts, peel and roughly chop the garlic. Using the flat side of your knife, smash the olives; remove and discard the pits, then roughly chop. Grate the cheese on the small side of a box grater."
            },
            {
                "title": null,
                "content": "While the broccoli continues to roast, add the pasta to the pot of boiling water and cook 8 to 10 minutes, or until al dente (still slightly firm to the bite). Turn off the heat. Reserving 1/2 cup of the pasta cooking water, drain thoroughly and return to the pot."
            },
            {
                "title": null,
                "content": "While the pasta cooks, in a medium pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the chopped garlic, capers, and as much of the red pepper flakes as you’d like, depending on how spicy you’d like the dish to be; season with salt and pepper. Cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the tomatoes and chopped olives; season with salt and pepper. Cook, stirring occasionally and gently crushing the tomatoes with the back of a spoon, 6 to 7 minutes, or until thickened. Turn off the heat and season with salt and pepper to taste."
            },
            {
                "title": "Finish & serve your dish",
                "content": "To the pot of cooked pasta, add the roasted broccoli, sauce, butter, half the grated cheese, and half the reserved pasta cooking water; season with salt and pepper. Cook on medium-high, stirring vigorously, 1 to 2 minutes, or until the pasta is thoroughly coated. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Turn off the heat and season with salt and pepper to taste. Garnish the finished pasta with the remaining grated cheese. Enjoy!"
            }
        ]
    },
    {
        "title": "Cheesy Enchiladas Rojas",
        "subtitle": "with Mushrooms & Kale",
        "description": "Our hearty vegetarian enchiladas are filled with a combination of fragrant, Mexican-spiced rice and sautéed mushrooms and kale. For even more flavor, weʼre baking them under a smoky-sweet tomato sauce flavored with ancho chile paste and a layer of melty white cheddar. A dollop of lime-seasoned sour cream adds creamy, cooling balance. (You may receive green curly, dark green lacinato, or red kale.)",
        "ingredients": [
            "8 Flour Tortillas",
            "3/4 cup Jasmine Rice",
            "1 28-Ounce Can Whole Peeled Tomatoes",
            "4 oz Cremini Mushrooms",
            "3 cloves Garlic",
            "1 Yellow Onion",
            "1 bunch Chives",
            "2 Tbsps Ancho Chile Paste",
            "1 Tbsp Mexican Spice Blend (Ancho Chile Powder, Sweet Paprika, Garlic Powder, Ground Cumin, & Whole Mexican Oregano)",
            "1/2 lb White Cheddar Cheese",
            "1/2 cup Sour Cream"
        ],
        "kitchen_tools": {
            "name": "Box Grater",
            "description": "This sturdy tool offers four grater sizes, a comfortable grip, and a design thatʼs easy to clean. Whether carrots or cheddar, rutabaga or gouda, this box grater shreds everything from root veggies to cheese with ease. Simple and sturdy, the stainless steel grater features four precision-cut surfaces that yield coarse, medium, fine, and super fine textures; thereʼs also a slicing edge. Its easy-grip handle allows for efficient, comfortable work and its straight-edged base wonʼt collect stray bits, making for quicker clean up."
        },
        "steps": [
            {
                "title": null,
                "content": "Place an oven rack in the center of the oven, then preheat to 450°F. In a medium pot, combine the rice, half the spice blend, a big pinch of salt, and 1 1/2 cups of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Turn off the heat and fluff with a fork. Transfer to a large bowl and set aside in a warm place."
            },
            {
                "title": "Prepare the ingredients & make the lime sour cream",
                "content": "While the rice cooks, wash and dry the fresh produce. Thinly slice the mushrooms. Remove and discard the stems of the kale; roughly chop the leaves. Peel and roughly chop the garlic. Peel and thinly slice the onion. Place the tomatoes in a bowl; gently break apart with your hands. Grate the cheese on the large side of a box grater. Thinly slice the chives. Halve the lime crosswise. In a bowl, combine the sour cream, the juice of 1 lime half, and a drizzle of olive oil; season with salt and pepper to taste."
            },
            {
                "title": "Cook the vegetables & start the filling",
                "content": "In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the sliced mushrooms in an even layer. Cook, without stirring, 2 to 3 minutes, or until lightly browned. Add the chopped kale and 1/2 cup of water; season with salt and pepper. Cook, stirring frequently, 4 to 5 minutes, or until the kale has wilted and the water has cooked off. Transfer to the bowl of cooked rice; stir to combine. Wipe out the pan."
            },
            {
                "title": null,
                "content": "In the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the chopped garlic and sliced onion; season with salt and pepper. Cook, stirring frequently, 4 to 5 minutes, or until softened. Add the chile paste and remaining spice blend; cook, stirring constantly, 30 seconds to 1 minute, or until dark red and fragrant. Add the tomatoes; season with salt and pepper. Cook, stirring frequently, 6 to 7 minutes, or until thickened. Turn off the heat. Season with salt and pepper to taste."
            },
            {
                "title": "Finish the filling & assemble the enchiladas",
                "content": "Add half the cheese and the juice of the remaining lime half to the bowl of filling. Stir to combine; season with salt and pepper to taste. Place the tortillas on a work surface. Spread about half the sauce into the bottom of a baking dish. Divide the finished filling among the tortillas; tightly roll up each tortilla around the filling. Transfer to the baking dish in a single layer, seam side down. Evenly top with the remaining sauce and remaining cheese."
            },
            {
                "title": "Bake the enchiladas & serve your dish",
                "content": "Bake the enchiladas 10 to 12 minutes, or until the cheese has melted. Remove from the oven and let stand for at least 2 minutes. Garnish with the sliced chives. Serve with the lime sour cream. Enjoy!"
            }
        ]
    },
    {
        "title": "Crispy Fish Sandwiches",
        "subtitle": "with Tartar Sauce & Roasted Sweet Potato Wedges",
        "description": "These sandwiches highlight wild Alaskan pollock—flavored with aromatic seasonings, coated with panko breadcrumbs, and pan-fried for a golden-brown crust. In classic fashion, a tangy, mayo-based tartar sauce perfectly balances the fish.",
        "ingredients": [
            "21 oz Wild Alaskan Pollock Fillets",
            "2 Cage-Free Farm Eggs",
            "2 Tbsps Sweet Pickle Relish",
            "1 Romaine Lettuce Heart",
            "1 Tbsp Weeknight Hero Spice Blend (Garlic Powder, Onion Powder, Smoked Paprika, & Whole Dried Parsley)",
            "1 1/4 cups Panko Breadcrumbs",
            "1/4 cup Creamy Mustard Sauce"
        ],
        "kitchen_tools": {
            "name": "Slotted Spatula",
            "description": "Master your flipping skills with this commercial-grade slotted turner. This spatula is designed for delicate fish, but we use this versatile tool for anything that requires a deft hand for tricky flipping, such as over-easy eggs, paper-thin crepes or even a burger. With its low-angled beveled edge and flexible blade, this turner slips easily between the pan and your dinner, ensuring even the most delicate meal remains in picture-perfect condition."
        },
        "steps": [
            {
                "title": "Prepare & roast the sweet potatoes",
                "content": "Place an oven rack in the center of the oven, then preheat to 450°F. Wash and dry the fresh produce. Cut the sweet potatoes lengthwise into 1-inch-wide wedges. Place on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer, skin side down. Roast 27 to 29 minutes, or until browned and tender when pierced with a fork. Reserving the sheet pan, transfer to a plate and set aside in a warm place."
            },
            {
                "title": "Prepare the remaining ingredients & make the sauce",
                "content": "While the sweet potatoes roast, cut off and discard the root end of the lettuce; thinly slice the leaves. Halve the rolls. In a bowl, combine the mayonnaise, creamy mustard sauce, and sweet pickle relish. Season with salt and pepper to taste. Pat the fish fillets dry with paper towels. Halve crosswise."
            },
            {
                "title": null,
                "content": "While the sweet potatoes continue to roast, season the halved fish fillets on both sides with salt, pepper, and the spice blend. Crack the eggs into a bowl; season with salt and pepper. Beat until smooth. Place the breadcrumbs on a plate; season with salt and pepper. Working one piece at a time, thoroughly coat the seasoned fillets in the beaten eggs (letting any excess drip off), then in the breadcrumbs (pressing to adhere). Transfer to a separate plate."
            },
            {
                "title": null,
                "content": "While the sweet potatoes continue to roast, in a large pan (nonstick, if you have one), heat a thin layer of oil on medium-high until hot. Once the oil is hot enough that a pinch of breadcrumbs sizzles immediately when added, working in batches if necessary, add the breaded fish fillets. Cook 2 to 3 minutes per side, or until browned and cooked through. (If the pan seems dry, add 1 teaspoon of olive oil before flipping.) Transfer to a paper towel-lined plate; immediately season with salt and pepper."
            },
            {
                "title": null,
                "content": "While the fish cooks, place the rolls on the same sheet pan, cut side up. Drizzle with olive oil. Toast in the oven 4 to 5 minutes, or until lightly browned. Transfer to a clean work surface."
            },
            {
                "title": "Assemble the sandwiches & serve your dish",
                "content": "Divide the sauce, cooked fish fillets, and sliced lettuce among the toasted rolls. Serve the sandwiches with the roasted sweet potatoes on the side. Enjoy!"
            }
        ]
    },
    {
        "title": "General Tso's Chicken",
        "subtitle": "with Bok Choy & Jasmine Rice",
        "description": "In this quick-cooking spin on a takeout favorite, hoisin sauce, honey, sriracha, and sesame oil lend our chicken the sweet, spicy, and nutty flavors General Tsoʼs is known for. A light dusting of cornstarch on the chicken just before it hits the pan creates a delicately crispy exterior (and helps it soak up the irresistible sauce later).",
        "ingredients": [
            "10 oz Chopped Chicken Breast",
            "1 head Baby Bok Choy",
            "3/4 cup Jasmine Rice",
            "2 cloves Garlic",
            "1 Tbsp Rice Vinegar",
            "1 1-Inch Piece Ginger",
            "1 tsp Sriracha",
            "1 Tbsp Honey",
            "1 Tbsp Sesame Oil",
            "1/4 cup Cornstarch",
            "2 Tbsps Hoisin Sauce"
        ],
        "kitchen_tools": {
            "name": "Olive Wood Spoon by Eddington",
            "description": "Stir some old-world charm into your next meal with this sturdy spoon made from Italian-grown olive wood. For home cooks and professional chefs alike, this multi-purpose 14” blunt-end spoon is a must-have item. Stain and odor resistant, this spoon will not scratch porcelain, ceramic, glass, or enamel surfaces, and wonʼt heat up while you stir. Each unique olive wood spoon brings a sense of quality and professionalism to even the simplest tasks, like stirring sauce or deglazing a pan."
        },
        "steps": [
            {
                "title": null,
                "content": "Remove the honey from the refrigerator to bring to room temperature. In a medium saucepan, combine the rice, a big pinch of salt, and 1 1/2 cups of water; heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Turn off the heat and fluff with a fork. Cover to keep warm."
            },
            {
                "title": "Coat & cook the chicken",
                "content": "While the rice cooks, pat the chicken dry with paper towels. Place in a large bowl and season with salt and pepper. Add the cornstarch; toss to thoroughly coat. In a medium pan, heat a thin layer of oil on medium-high until hot. Once the oil is hot enough that a piece of chicken sizzles immediately when added to the pan, add the coated chicken in an even layer (tapping off any excess cornstarch before adding). Cook, without stirring, 3 to 4 minutes, or until lightly browned. Continue to cook, stirring occasionally, 3 to 4 minutes, or until browned and cooked through. Leaving any browned bits (or fond) in the pan, transfer to a plate. Set aside in a warm place"
            },
            {
                "title": "Prepare the ingredients & make the sauce",
                "content": "While the chicken cooks, wash and dry the fresh produce. Cut off and discard the root end of the bok choy; roughly chop. Peel and finely chop the ginger. Peel and roughly chop the garlic. In a bowl, combine the hoisin sauce, vinegar, honey (kneading the packet before opening), sesame oil, 1 tablespoon of water, and as much of the sriracha as you’d like, depending on how spicy you’d like the dish to be."
            },
            {
                "title": null,
                "content": "Add the chopped bok choy, ginger, and garlic to the pan of reserved fond; season with salt and pepper. (If the pan seems dry, add 1 tablespoon of olive oil.) Cook on medium-high, stirring frequently, 2 to 3 minutes, or until softened and fragrant. Add the sauce and cook, stirring constantly and scraping up any fond, 30 seconds to 1 minute, or until thoroughly combined."
            },
            {
                "title": "Finish & serve your dish",
                "content": "Turn off the heat and add the cooked chicken to the pan; stir to thoroughly coat. Season with salt and pepper to taste. Serve the finished chicken and bok choy with the cooked rice. Enjoy!"
            }
        ]
    },
    {
        "title": "Hoisin-Glazed Pork Chops",
        "subtitle": "with Stir-Fried Vegetables & Wonton Noodles",
        "description": "Delightfully chewy wonton noodles tossed in a nutty, savory sauce are a delicious accompaniment to these pork chops. For depth of flavor, weʼre pan-searing the pork chops, then glazing them with barbecue-like hoisin, whose sweetness perfectly matches bites of sautéed carrots in the noodles.",
        "ingredients": [
            "4 Boneless, Center-Cut Pork Chops",
            "2 Carrots",
            "1 bunch Chives",
            "2 Tbsps Tahini",
            "2 Tbsps Soy Sauce",
            "3/4 lb Fresh Wonton Noodles",
            "2 tsps Sambal Oelek",
            "1 1-Inch Piece Ginger",
            "1/4 cup Hoisin Sauce"
        ],
        "kitchen_tools": {
            "name": "Stainless Steel Strainer",
            "description": "A stainless steel strainer is a handy tool for quinoa. It's great for draining grains and pastas (not to mention small fruits and vegetables after washing) and straining stocks and gravy. Lightweight and sturdy, itʼs constructed with a double-fine mesh."
        },
        "steps": [
            {
                "title": "Prepare the ingredients",
                "content": "Fill a medium pot with water; add a pinch of salt. Heat to boiling on high. Wash and dry the fresh produce. Peel and finely chop the ginger. Cut out and discard the core of the cabbage; thinly slice the leaves. Peel the carrots and thinly slice into rounds. Thinly slice the chives."
            },
            {
                "title": "Cook the vegetables",
                "content": "In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the chopped ginger, sliced cabbage, and sliced carrots; season with salt and pepper. Cook, stirring occasionally, 4 to 5 minutes, or until softened and fragrant. Transfer to a bowl and cover with aluminum foil to keep warm. Rinse and wipe out the pan."
            },
            {
                "title": "Cook & glaze the pork chops",
                "content": "Pat the pork chops dry with paper towels; season with salt and pepper on both sides. In the same pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned pork chops and cook 3 to 5 minutes on the first side, or until browned. Flip and cook 2 to 3 minutes, or until lightly browned. Add the hoisin sauce and 1/4 cup of water. Cook, frequently spooning the glaze over the pork, 2 to 3 minutes, or until the pork chops are coated and cooked through. Turn off the heat."
            },
            {
                "title": null,
                "content": "While the pork chops cook, in a bowl, whisk together the soy sauce, tahini, vinegar, and as much of the sambal oelek as you’d like, depending on how spicy you’d like the dish to be. Season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "While the pork chops continue to cook, using your hands, carefully separate the noodles and add to the pot of boiling water; cook, stirring occasionally, 2 to 4 minutes, or until tender. Turn off the heat. Drain thoroughly and return to the pot."
            },
            {
                "title": "Finish the noodles & serve your dish",
                "content": "Add the cooked vegetables, sauce, and 1/4 cup of water to the pot of cooked noodles. Cook on medium-high, stirring constantly, 30 seconds to 1 minute, or until thoroughly combined. Turn off the heat. Season with salt and pepper to taste. Serve the finished noodles topped with the glazed pork chops (including any glaze from the pan). Garnish with the sliced chives. Enjoy!"
            }
        ]
    },
    {
        "title": "Honey-Butter Barramundi",
        "subtitle": "with Za'atar Roasted Vegetables",
        "description": "This Middle Eastern recipe pairs crispy barramundi—served in a family-friendly pan sauce of honey and butter—with a medley of winter vegetables. For savory, herby flavor, weʼre seasoning the vegetables with zaʼatar before roasting them.",
        "ingredients": [
            "4 Skin-On Barramundi Fillets",
            "1/2 cup Plain Greek Yogurt",
            "1 1/8 lbs Yukon Gold Potatoes",
            "1 Tbsp Za'atar Seasoning (Ground Sumac, Sesame Seeds, Salt, Ground Thyme, Whole Dried Oregano, & Crushed Aleppo Pepper)"
        ],
        "kitchen_tools": {
            "name": "Large Maple Cutting Board by John Boos & Co. for Blue Apron",
            "description": "Built to last, this chopping board is prized by professional chefs and so gorgeous we never want to take it off the counter. Crafted with hardy American maple, this exclusive collaboration between Blue Apron and John Boos & Co. is equal parts beautiful and handy. Its durable surface wonʼt warp and is resistant to scoring; magically, it also helps keep your blades sharper than other materials. Youʼll find these boards in our test kitchen—as well as professional kitchens around the world."
        },
        "steps": [
            {
                "title": "Prepare the ingredients",
                "content": "Remove the honey from the refrigerator to bring to room temperature. Place an oven rack in the center of the oven, then preheat to 450°F. Wash and dry the fresh produce. Halve the potatoes lengthwise; cut crosswise into 1/4-inch pieces. Peel the carrots; halve lengthwise, then cut crosswise into 1/2-inch pieces. Cut off and discard the ends of the radishes; quarter lengthwise, then halve crosswise. Quarter and deseed the lemon. Peel and finely chop the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Roughly chop the parsley leaves and stems."
            },
            {
                "title": "Roast the vegetables",
                "content": "Place the sliced potatoes and carrot pieces on a sheet pan. Drizzle with 1 tablespoon of olive oil; season with salt, pepper, and the za’atar seasoning. Toss to coat. Arrange in an even layer on one side of the sheet pan. Roast 12 to 14 minutes, or until lightly browned. Leaving the oven on, remove from the oven. Place the radish pieces in a bowl. Drizzle with olive oil and season with salt and pepper; toss to coat. Carefully arrange on the other side of the sheet pan. Roast 10 to 12 minutes, or until tender when pierced with a fork. Remove from the oven. Evenly top with the juice of 2 lemon wedges."
            },
            {
                "title": "Make the yogurt sauce",
                "content": "While the vegetables roast, in a bowl, combine the yogurt, the juice of the remaining lemon wedges, 1 tablespoon of olive oil, and as much of the garlic paste as you’d like. Drizzle with olive oil and season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "Once the vegetables have roasted for about 10 minutes, pat the fish fillets dry with paper towels; season with salt and pepper on both sides. In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned fillets, skin side down. Cook 4 to 6 minutes on the first side, or until lightly browned. Flip and add the butter. Cook, frequently spooning the butter over the fillets, 2 to 3 minutes, or until the fish is cooked through. Leaving the melted butter and any browned bits (or fond) in the pan, transfer the cooked fillets to a plate."
            },
            {
                "title": "Make the pan sauce",
                "content": "Add the honey (kneading the packet before opening) and 2 tablespoons of water to the pan of melted butter (be careful, as the liquid may splatter). Cook on medium-high, stirring frequently and scraping up any fond, 30 seconds to 1 minute, or until slightly thickened. Turn off the heat and season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "Serve the cooked fish fillets and roasted vegetables with the yogurt sauce on the side. Top the fish with the pan sauce. Garnish with the chopped parsley. Enjoy!"
            }
        ]
    },
    {
        "title": "Kale & Ricotta Quiche",
        "subtitle": "with Romaine, Apple, & Almond Salad",
        "description": "This crowd-pleasing quiche showcases a rich, eggy filling made with ricotta and cream — balanced by hearty sautéed kale. On the side, weʼre serving a refreshing salad of crisp romaine and apple, wrapped in a creamy lemon dressing.",
        "ingredients": [
            "4 Cage-Free Farm Eggs",
            "1 cup Part-Skim Ricotta Cheese",
            "1 Romaine Lettuce Heart",
            "2 Tbsps Sliced Roasted Almonds",
            "1 Tbsp Cajun Spice Blend (Smoked Paprika, Ground Yellow Mustard, Onion Powder, Garlic Powder, Whole Dried Oregano, Whole Dried Thyme, & Cayenne Pepper)",
            "2 Tbsps Crème Fraîche"
        ],
        "kitchen_tools": {
            "name": "Large Maple Cutting Board by John Boos & Co. for Blue Apron",
            "description": "Built to last, this chopping board is prized by professional chefs and so gorgeous we never want to take it off the counter. Crafted with hardy American maple, this exclusive collaboration between Blue Apron and John Boos & Co. is equal parts beautiful and handy. Its durable surface wonʼt warp and is resistant to scoring; magically, it also helps keep your blades sharper than other materials. Youʼll find these boards in our test kitchen—as well as professional kitchens around the world."
        },
        "steps": [
            {
                "title": "Prepare the ingredients",
                "content": "Preheat the oven to 425°F. Wash and dry the fresh produce. Peel and roughly chop the garlic. Peel and thinly slice the shallot. Remove and discard the stems of the kale; roughly chop the leaves. Quarter and deseed the lemon."
            },
            {
                "title": null,
                "content": "In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the chopped garlic and sliced shallot; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened and fragrant. Add the chopped kale, heavy cream (shaking the bottle just before opening), and 1/4 cup of water; season with salt and pepper. Cook, stirring occasionally, 4 to 5 minutes, or until the kale has wilted and most of the liquid has cooked off. Turn off the heat. Season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "Crack the eggs into a large bowl. Add the ricotta cheese, the juice of 1 lemon wedge, and the spice blend; season with salt and pepper. Whisk to thoroughly combine. Stir in the cooked kale."
            },
            {
                "title": "Assemble & bake the quiche",
                "content": "Place the pie crust on a sheet pan, leaving it in its tin. Carefully pour the filling into the crust; season with salt and pepper. Bake 24 to 26 minutes, or until the crust is browned and the filling is set and cooked through. Remove from the oven. Let stand for at least 5 minutes before serving."
            },
            {
                "title": "Prepare the remaining ingredients",
                "content": "While the quiche bakes, quarter and core the apple; thinly slice lengthwise. Place in a bowl and top with the juice of 1 lemon wedge to prevent browning. Cut off and discard the root end of the lettuce; roughly chop the leaves. To make the dressing, in a large bowl, combine the crème fraîche, the juice of the remaining lemon wedges, and a drizzle of olive oil. Season with salt and pepper to taste."
            },
            {
                "title": "Make the salad & serve your dish",
                "content": "Just before serving, add the sliced apple and chopped lettuce to the bowl of dressing. Toss to combine; season with salt and pepper to taste. Serve the baked quiche with the salad on the side. Garnish the salad with the almonds. Enjoy!"
            }
        ]
    },
    {
        "title": "Mushroom & Potato Tacos",
        "subtitle": "with Romaine & Orange Salad",
        "description": "For this hearty vegetarian meal, weʼre filling soft flour tortillas with mushrooms and potato—seasoned with a zesty, chorizo-inspired blend, then roasted. A pickled pepper relish lends bright flavor to the tacos, all tied together with a creamy sauce seasoned with the same spices. Our side salad of juicy orange and crunchy romaine rounds out the dish.",
        "ingredients": [
            "4 Flour Tortillas",
            "3 oz Radishes",
            "1 Orange",
            "3/4 lb Yukon Gold Potatoes",
            "6 oz Cremini Mushrooms",
            "1 Shallot",
            "3 Tbsps Roasted Peanuts",
            "1/4 cup Sour Cream",
            "1 oz Sliced Pickled Jalapeño Pepper",
            "1 oz Golden Or Red Sweet Piquante Peppers",
            "1 Tbsp Spanish Spice Blend (Smoked Paprika, Ground Cumin, Ground Coriander, Dried Mexican Oregano, Cayenne Pepper, & Ground Cinnamon)",
            "1 Romaine Lettuce Heart",
            "2 Tbsps Rice Vinegar"
        ],
        "kitchen_tools": {
            "name": "Quarter-Sheet Pan by Nordic Ware",
            "description": "Whether youʼre flying solo or making dinner for two, this delightfully durable pan is about to become your next kitchen essential. This smaller version of the classic sheet pan is ideal for toasting up bread or whipping up a small batch of roasted vegetables for a single meal. Easy to store, its raised lip catches and contains juices while minimizing mess inside the oven. Rustproof and even-heating, this pan has a galvanized steel reinforcement around the rim, which adds to its strength."
        },
        "steps": [
            {
                "title": "Prepare & roast the vegetables",
                "content": "Preheat the oven to 450°F. Wash and dry the fresh produce. Quarter the mushrooms. Quarter the potatoes lengthwise, then cut crosswise into 1/2- inch pieces. Place the vegetables on a sheet pan. Drizzle with olive oil and season with salt, pepper, and 3/4 of the spice blend; toss to coat. Arrange in an even layer. Roast 21 to 23 minutes, or until browned and tender when pierced with a fork. Remove from the oven."
            },
            {
                "title": "Prepare the remaining ingredients",
                "content": "While the vegetables roast, roughly chop the piquante peppers. Peel and small dice the shallot. Cut off and discard the root end of the lettuce; roughly chop the leaves. Peel and medium dice the orange. Cut off and discard the ends of the radishes; halve lengthwise, then thinly slice crosswise. Roughly chop the jalapeño pepper; thoroughly wash your hands and cutting board immediately after handling. In a bowl, combine the sour cream, a drizzle of olive oil, and as much of the remaining spice blend as you’d like (you may have extra). Season with salt and pepper to taste."
            },
            {
                "title": "Warm the tortillas",
                "content": "While the vegetables continue to roast, place the tortillas on a large piece of aluminum foil. Tightly wrap to seal. Place directly onto the oven rack and warm 5 to 7 minutes, or until heated through and pliable. Transfer to a work surface and carefully unwrap."
            },
            {
                "title": "Make the pepper relish",
                "content": "While the tortillas warm, in a medium bowl, combine the chopped piquante peppers, diced shallot, half the vinegar, and as much of the chopped jalapeño pepper as you’d like, depending on how spicy you’d like the dish to be. Drizzle with olive oil and season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "While the tortillas continue to warm, in a medium bowl, combine the chopped lettuce, diced orange, sliced radishes, peanuts, and remaining vinegar. Drizzle with olive oil and season with salt and pepper to taste."
            },
            {
                "title": "Assemble the tacos & serve your dish",
                "content": "Spread a layer of the seasoned sour cream onto the warmed tortillas. Top with the roasted vegetables and pepper relish. Serve the tacos with the salad on the side. Enjoy!"
            }
        ]
    },
    {
        "title": "Parmesan-Crusted Chicken",
        "subtitle": "with Mashed Sweet Potatoes & Roasted Broccoli",
        "description": "In this simple, seasonal recipe, youʼll coat chicken in a combination of flour, parmesan cheese, and savory spices before pan-searing it. Weʼre adding more of the same spices to a bright, creamy sauce, perfect for spooning over the chicken and broccoli.",
        "ingredients": [
            "4 Boneless, Skinless Chicken Breasts",
            "1/4 cup All-Purpose Flour",
            "1/2 cup Grated Parmesan Cheese",
            "1 Tbsp Weeknight Hero Spice Blend (Garlic Powder, Onion Powder, Smoked Paprika, & Whole Dried Parsley)"
        ],
        "kitchen_tools": {
            "name": "Large Maple Cutting Board by John Boos & Co. for Blue Apron",
            "description": "Built to last, this chopping board is prized by professional chefs and so gorgeous we never want to take it off the counter. Crafted with hardy American maple, this exclusive collaboration between Blue Apron and John Boos & Co. is equal parts beautiful and handy. Its durable surface wonʼt warp and is resistant to scoring; magically, it also helps keep your blades sharper than other materials. Youʼll find these boards in our test kitchen—as well as professional kitchens around the world."
        },
        "steps": [
            {
                "title": "Prepare the ingredients",
                "content": "Place an oven rack in the center of the oven, then preheat to 450°F. Heat a medium pot of salted water to boiling on high. Wash and dry the fresh produce. Cut off and discard the bottom 1/2 inch of the broccoli stem; cut the broccoli into small pieces, keeping the florets intact. Quarter and deseed the lemon. Peel and medium dice the sweet potatoes."
            },
            {
                "title": "Roast the broccoli",
                "content": "Place the broccoli pieces on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer. Roast 16 to 18 minutes, or until browned and tender when pierced with a fork. Remove from the oven. Evenly top with the juice of 2 lemon wedges."
            },
            {
                "title": "Cook & mash the sweet potatoes",
                "content": "While the broccoli roasts, add the diced sweet potatoes to the pot of boiling water. Cook 14 to 16 minutes, or until tender when pierced with a fork. Turn off the heat. Drain thoroughly and return to the pot. Add the butter and a drizzle of olive oil. Using a fork, mash to your desired consistency; season with salt and pepper to taste. Cover to keep warm."
            },
            {
                "title": null,
                "content": "While the sweet potatoes cook, on a large plate, combine the flour, half the cheese, and all but a pinch of the spice blend; season with salt and pepper. Pat the chicken dry with paper towels; season with salt and pepper on both sides. Working one piece at a time, thoroughly coat the seasoned chicken in the flour mixture (tapping off any excess). Transfer to a separate plate."
            },
            {
                "title": null,
                "content": "While the sweet potatoes continue to cook, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the coated chicken and cook 5 to 7 minutes per side, or until golden brown and cooked through. Turn off the heat."
            },
            {
                "title": "Make the sauce & serve your dish",
                "content": "While the chicken cooks, in a bowl, combine the mayonnaise, remaining spice blend, and the juice of the remaining lemon wedges; season with salt and pepper to taste. Serve the cooked chicken, roasted broccoli, and mashed sweet potatoes with the sauce on the side. Garnish the chicken with the remaining cheese. Enjoy!"
            }
        ]
    },
    {
        "title": "Pimento Cheeseburgers",
        "subtitle": "with Sweet Potato Oven Fries",
        "description": "Tonight, the classic cheeseburger gets an easy, Southern-style lift from pimento cheese — a zesty spread made with cheddar, mayo, pickled peppers, and spices. Weʼre serving our burgers with sweet potato oven fries for a flavorful, seasonal twist on the usual side.",
        "ingredients": [
            "2 Potato Buns",
            "1 Sweet Potato",
            "2 oz Cheddar Cheese",
            "1 oz Sweet Piquante Peppers",
            "2 Tbsps Mayonnaise",
            "1 tsp Pimento Cheese Spice Blend (Garlic Powder, Ground Yellow Mustard, & Sugar)"
        ],
        "kitchen_tools": {
            "name": "Slotted Spatula",
            "description": "Master your flipping skills with this commercial-grade slotted turner. This spatula is designed for delicate fish, but we use this versatile tool for anything that requires a deft hand for tricky flipping, such as over-easy eggs, paper-thin crepes or even a burger. With its low-angled beveled edge and flexible blade, this turner slips easily between the pan and your dinner, ensuring even the most delicate meal remains in picture-perfect condition."
        },
        "steps": [
            {
                "title": "Prepare & roast the sweet potato",
                "content": "Place an oven rack in the center of the oven, then preheat to 450°F. Wash and dry the fresh produce. Cut the sweet potato lengthwise into 1-inch wedges. Transfer to a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer, skin side down. Roast 21 to 23 minutes, or until browned and tender when pierced with a fork. Set aside in a warm place."
            },
            {
                "title": "Prepare the remaining ingredients",
                "content": "While the sweet potato roasts, grate the cheese on the large side of a box grater. Place in a medium bowl. Finely chop the peppers. Halve the buns."
            },
            {
                "title": "Make the pimento cheese",
                "content": "While the sweet potato continues to roast, add the mayonnaise, spice blend, and peppers to the bowl of cheese. Stir to thoroughly combine; season with salt and pepper to taste."
            },
            {
                "title": "Form & cook the patties",
                "content": "While the sweet potato continues to roast, place the ground beef in a bowl; season with salt and pepper. Gently mix to incorporate. Using your hands, form the mixture into two 3/4-inch-thick patties; transfer to a plate. In a medium pan (nonstick, if you have one), heat 1 teaspoon of olive oil on medium-high until hot. Add the patties and cook 3 to 4 minutes per side for medium-rare, or until browned and cooked to your desired degree of doneness. Leaving any browned bits (or fond) in the pan, transfer to a plate."
            },
            {
                "title": null,
                "content": "While the sweet potato continues to roast, add the buns, cut side down, to the pan of reserved fond. Toast on medium-high 30 seconds to 1 minute, or until lightly browned. Transfer to a work surface."
            },
            {
                "title": "Assemble the burgers & plate your dish",
                "content": "Divide half the pimento cheese between the bottoms of the toasted buns. Top with the cooked patties and remaining pimento cheese. Complete the burgers with the bun tops. Divide the burgers and roasted sweet potato between 2 dishes. Enjoy!"
            }
        ]
    },
    {
        "title": "Pork Chorizo Tacos",
        "subtitle": "with Cheesy Roasted Potatoes",
        "description": "These tacos get plenty of bold flavor from ground chorizo (a type of spiced pork sausage), cooked into a delightfully saucy filling with cabbage and fresh citrus juices. On the side, weʼre livening up roasted potatoes with garlic and Cotija cheese.",
        "ingredients": [
            "3/4 lb Yukon Gold Potatoes",
            "10 oz Ground Pork Chorizo",
            "2 Tbsps Crème Fraîche",
            "2 Tbsps Grated Cotija Cheese"
        ],
        "kitchen_tools": {
            "name": "Quarter-Sheet Pan by Nordic Ware",
            "description": "Whether youʼre flying solo or making dinner for two, this delightfully durable pan is about to become your next kitchen essential. This smaller version of the classic sheet pan is ideal for toasting up bread or whipping up a small batch of roasted vegetables for a single meal. Easy to store, its raised lip catches and contains juices while minimizing mess inside the oven. Rustproof and even-heating, this pan has a galvanized steel reinforcement around the rim, which adds to its strength."
        },
        "steps": [
            {
                "title": "Prepare & roast the potatoes",
                "content": "Preheat the oven to 450°F. Wash and dry the fresh produce. Halve the potatoes lengthwise, then cut crosswise into 1/4-inch pieces. Place on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer. Roast 22 to 24 minutes, or until browned and tender when pierced with a fork. Carefully transfer to a large bowl."
            },
            {
                "title": "Prepare the remaining ingredients",
                "content": "While the potatoes roast, cut out and discard the core of the cabbage; thinly slice the leaves. Halve the orange; squeeze the juice into a bowl, straining out any seeds. Cut off and discard the ends of the radishes; halve lengthwise, then thinly slice crosswise. Peel and finely chop the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Quarter the lime. In a bowl, combine the crème fraîche and the juice of 1 lime wedge. Drizzle with olive oil and season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "While the potatoes continue to roast, in a medium pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the ground chorizo; season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 3 to 5 minutes, or until browned. Add the sliced cabbage; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until slightly softened. Add the orange juice and 1/2 cup of water; season with salt and pepper. Cook, stirring occasionally, 6 to 7 minutes, or until the cabbage has softened and the chorizo is cooked through. Turn off the heat and stir in the juice of 2 lime wedges; season with salt and pepper to taste."
            },
            {
                "title": "Warm the tortillas & season the radishes",
                "content": "While the filling cooks, place the tortillas on a large piece of aluminum foil and tightly wrap to seal. Place directly onto the oven rack and warm 5 to 7 minutes, or until heated through and pliable. Transfer to a work surface and carefully unwrap. While the tortillas warm, in a bowl, combine the sliced radishes and the juice of the remaining lime wedge. Drizzle with olive oil and season with salt and pepper."
            },
            {
                "title": "Finish the potatoes",
                "content": "While the tortillas continue to warm, add the cheese and as much of the garlic paste as you’d like to the bowl of roasted potatoes. Stir to coat; season with salt and pepper to taste."
            },
            {
                "title": "Assemble the tacos & serve your dish",
                "content": "Divide the filling, seasoned radishes, and lime crème fraîche among the warmed tortillas. Serve the tacos with the finished potatoes on the side. Enjoy!"
            }
        ]
    },
    {
        "title": "",
        "subtitle": "",
        "description": "",
        "ingredients": [
            ""
        ],
        "kitchen_tools": {
            "name": "",
            "description": ""
        },
        "steps": [
            {
                "title": "",
                "content": ""
            },
            {
                "title": "",
                "content": ""
            },
            {
                "title": "",
                "content": ""
            },
            {
                "title": "",
                "content": ""
            },
            {
                "title": "",
                "content": ""
            },
            {
                "title": "",
                "content": ""
            }
        ]
    }
]
