[
    {
        "title": "Ancho-Orange Chicken",
        "subtitle": "with Kale Rice & Roasted Carrots",
        "description": "Weʼre amping up chicken breasts with a glaze of smoky ancho chile paste and fresh orange juice in this recipe. On the side, roasted carrots and lightly creamy, golden raisin-studded rice perfectly accent the sweetness of the glaze.",
        "ingredients": [
            "4 Boneless, Skinless Chicken Breasts", 
            "1 Tbsp Ancho Chile Paste", 
            "2 Tbsps Crème Fraîche", 
            "3 Tbsps Golden Raisins"
        ],
        "kitchen_tools": {
            "name": "Garlic Press",
            "description": "Slicing garlic has never been simpler. This two-sided essential is designed to do two jobs in one: crush garlic and slice it. Made by Harold Import Company, a family-owned American business with over 50 years of experience, this easy-to-use press owes its incredible durability to its heavyweight, stainless steel construction. To use it, simply place the clove in the hopper and press downward for freshly pressed garlic, or flip it over to get uniform slices of garlic. And to ensure minimal mess, it includes a handy cleaning tool for removing leftover pressed garlic after use."
        },
        "steps": [
            {
                "title": null,
                "content": "Place an oven rack in the center of the oven, then preheat to 450°F. In a medium pot, combine the <b>rice, a big pinch of salt,</b> and <b>1 1/2 cups of water</b>. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Turn off the heat and fluff with a fork. Cover to keep warm."
            },
            {
                "title": "Prepare the ingredients & make the glaze",
                "content": "While the rice cooks, wash and dry the fresh produce. Peel the <b>carrots</b>; quarter lengthwise, then halve crosswise. Peel and roughly chop the <b>garlic</b>. Remove and discard the stems of the <b>kale</b>; finely chop the leaves. Using a peeler, remove the <b>lime</b> rind, avoiding the white pith; mince to get 2 teaspoons of zest (or use a zester). Halve the lime crosswise. Halve the <b>orange</b>; squeeze the juice into a bowl, straining out any seeds. Whisk in the <b>chile paste</b> and <b>2 tablespoons of water</b> until smooth."
            },
            {
                "title": null,
                "content": "Place the <b>sliced carrots</b> on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer. Roast 15 to 17 minutes, or until tender when pierced with a fork. Remove from the oven."
            },
            {
                "title": null,
                "content": "While the carrots roast, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the <b>chopped garlic</b> and cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the <b>chopped kale</b>; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until slightly wilted. Add <b>1/3 cup of water</b>; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until the kale has wilted and the water has cooked off. Transfer to the pot of <b>cooked rice</b>. Stir to combine; season with salt and pepper to taste. Cover to keep warm. Wipe out the pan."
            },
            {
                "title": "Cook & glaze the chicken",
                "content": "While the carrots continue to roast, pat the <b>chicken</b> dry with paper towels; season with salt and pepper on both sides. In the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned chicken and cook 4 to 6 minutes on the first side, or until browned. Flip and cook 2 to 3 minutes, or until lightly browned. Add the <b>glaze</b> and cook, frequently spooning the glaze over the chicken, 2 to 3 minutes, or until the chicken is coated and cooked through. Turn off the heat; stir the <b>butter</b> and <b>the juice of 1 lime half</b> into the glaze until the butter has melted. Season with salt and pepper to taste."
            },
            {
                "title": "Finish the rice & serve your dish",
                "content": "To the pot of <b>cooked rice and kale</b>, add the <b>lime zest, crème fraîche, raisins,</b> and <b>the juice of the remaining lime half</b>. Stir to combine; season with salt and pepper to taste. Serve the <b>glazed chicken</b> with the finished rice and <b>roasted carrots</b>. Top the chicken with the remaining glaze from the pan. Enjoy!"
            }
        ]
    },
    {
        "title": "Beef Medallions & Mushroom Sauce",
        "subtitle": "with Mashed Potatoes",
        "description": "In this easy recipe, inspired by steak Diane (an American restaurant classic), weʼre searing beef medallions, then using the fond in the pan to make a rich, bright mushroom sauce for spooning on top. Garlic mashed potatoes and sautéed kale make for delicious, simple sides.",
        "ingredients": [
            "4 oz Cremini Mushrooms",
            "3/4 lb Yukon Gold Potatoes"
        ],
        "kitchen_tools": {
            "name": "Slotted Spatula",
            "description": "Master your flipping skills with this commercial-grade slotted turner. This spatula is designed for delicate fish, but we use this versatile tool for anything that requires a deft hand for tricky flipping, such as over-easy eggs, paper-thin crepes or even a burger. With its low-angled beveled edge and flexible blade, this turner slips easily between the pan and your dinner, ensuring even the most delicate meal remains in picture-perfect condition."
        },
        "steps": [
            {
                "title": "Prepare the ingredients",
                "content": "Heat a medium pot of salted water to boiling on high. Wash and dry the fresh produce. Large dice the <b>potatoes</b>. Peel the <b>garlic</b>. Using the flat side of your knife, smash 1 clove to flatten. Roughly chop the remaining clove. Peel and thinly slice the <b>shallot</b>. Remove and discard the stems of the <b>kale</b>; roughly chop the leaves. Thinly slice the <b>mushrooms</b>."
            },
            {
                "title": "Cook & mash the potatoes",
                "content": "Add the <b>diced potatoes</b> and smashed garlic to the pot of boiling water and cook 13 to 15 minutes, or until tender when pierced with a fork. Turn off the heat. Drain thoroughly and return to the pot. Add <b>half the butter</b> and a drizzle of olive oil. Using a fork, mash to your desired consistency. Season with salt and pepper to taste. Cover to keep warm."
            },
            {
                "title": null,
                "content": "While the potatoes cook, in a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the <b>sliced shallot</b>; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened. Add the <b>chopped kale</b> and <b>1/4 cup of water</b>; season with salt and pepper. Cook, stirring frequently, 3 to 4 minutes, or until the kale has wilted and the water has cooked off. Transfer to a bowl and season with salt and pepper to taste. Cover with aluminum foil to keep warm. Rinse and wipe out the pan."
            },
            {
                "title": null,
                "content": "While the potatoes continue to cook, pat the <b>beef</b> dry with paper towels. Season with salt and pepper on both sides. In the same pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned beef and cook 2 to 3 minutes per side for medium-rare, or until browned and cooked to your desired degree of doneness. Leaving any browned bits (or fond) in the pan, transfer to a plate and let rest for at least 5 minutes."
            },
            {
                "title": "Make the mushroom sauce",
                "content": "While the beef rests, add a drizzle of olive oil to the pan of reserved fond and heat on medium-high until hot. Add the <b>sliced mushrooms</b> in an even layer. Cook, without stirring, 2 to 3 minutes, or until browned. Add the <b>chopped garlic</b>; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until softened and fragrant. Add the <b>mustard, verjus,</b> and <b>2 tablespoons of water</b> (be careful, as the liquid may splatter); season with salt and pepper. Cook, stirring frequently and scraping up any fond, 30 seconds to 1 minute, or until thoroughly combined. Turn off the heat and stir in the <b>remaining butter</b> until melted. (If the sauce seems too thick, gradually add up to 2 tablespoons of water to achieve your desired consistency.) Season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "Serve the <b>rested beef</b> with the <b>mashed potatoes</b> and <b>cooked kale</b>. Top the beef and potatoes with the <b>mushroom sauce</b>. Enjoy!"
            }
        ]
    },
    {
        "title": "Broccoli & Basil Pesto Sandwiches",
        "subtitle": "with Romaine & Citrus Salad",
        "description": "These Italian focaccia sandwiches are layered with broccoli, three cheeses, and a savory basil, cashew, and pine nut pesto, then baked in the oven to meld all the bright, aromatic flavors. On the side, weʼre serving a refreshing salad of romaine and seasonal clementine, dressed in a creamy dressing made with fresh clementine juice.",
        "ingredients": [
            "1 Piece Focaccia Bread",
            "1 8-Ounce Can Tomato Sauce",
            "1/2 lb Fresh Mozzarella Cheese",
            "2 Clementines",
            "2 cloves Garlic",
            "2 Romaine Lettuce Hearts",
            "1 lb Broccoli",
            "1 oz Golden Or Red Sweet Piquante Peppers",
            "2 Tbsps Crème Fraîche",
            "1 Tbsp Dijon Mustard",
            "1/2 cup Basil & Cashew Pesto (Contains Pine Nuts)",
            "1/3 cup Shaved Parmesan Cheese",
            "1 Tbsp Italian Seasoning (Whole Dried Basil, Sage, Oregano, Savory, Rosemary, Thyme, & Marjoram)"
        ],
        "kitchen_tools": {
            "name": "Large Maple Cutting Board by John Boos & Co. for Blue Apron",
            "description": "Built to last, this chopping board is prized by professional chefs and so gorgeous we never want to take it off the counter. Crafted with hardy American maple, this exclusive collaboration between Blue Apron and John Boos & Co. is equal parts beautiful and handy. Its durable surface wonʼt warp and is resistant to scoring; magically, it also helps keep your blades sharper than other materials. Youʼll find these boards in our test kitchen—as well as professional kitchens around the world."
        },
        "steps": [
            {
                "title": "Prepare the ingredients & season the tomato sauce",
                "content": "Place an oven rack in the center of the oven, then preheat to 475°F. Wash and dry the fresh produce. Cut off and discard the bottom 1/2 inch of the <b>broccoli</b> stem; cut the broccoli into small pieces, keeping the florets intact. Peel and roughly chop the <b>garlic</b>. Halve the <b>focaccia</b>. Grate the <b>asiago cheese</b> on the large side of a box grater. Tear the <b>mozzarella cheese</b> into small pieces. In a bowl, combine the <b>tomato sauce</b> and <b>Italian seasoning</b>; season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the <b>broccoli pieces</b>; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until slightly softened. Add the <b>chopped garlic</b>; cook, stirring frequently, 1 to 2 minutes, or until slightly softened and fragrant. Add <b>1/2 cup of water</b>; season with salt and pepper. Cook, stirring occasionally, 4 to 5 minutes, or until the broccoli has softened and the water has cooked off. Turn off the heat."
            },
            {
                "title": "Top & bake the focaccia",
                "content": "Line a sheet pan with foil. Place the <b>halved focaccia</b> on the foil, cut side up; drizzle with olive oil. Top with the <b>seasoned tomato sauce</b>. Top the focaccia bottom with the <b>grated asiago cheese, half the mozzarella cheese,</b> and the <b>cooked broccoli</b>. Evenly top the broccoli with the <b>remaining mozzarella cheese</b> and <b>pesto</b> (stirring before adding). Season both focaccia halves with salt and pepper. Bake, rotating the sheet pan halfway through, 11 to 13 minutes, or until lightly browned and the cheese has melted. Remove from the oven; let stand for at least 2 minutes. Transfer to a cutting board."
            },
            {
                "title": "Prepare the remaining ingredients",
                "content": "While the focaccia bakes, cut off and discard the root end of the <b>lettuce</b>; roughly chop the leaves. Place in a large bowl. Roughly chop the <b>peppers</b>. Halve <b>1 clementine</b> crosswise; squeeze the juice into a bowl, straining out any seeds. Peel the <b>remaining clementine</b>; separate into segments. To make the dressing, add the <b>crème fraîche, mustard,</b> and <b>1 tablespoon of water</b> to the bowl of clementine juice. Slowly whisk in a drizzle of olive oil until combined; season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "Just before serving, add the <b>clementine segments, chopped peppers,</b> and <b>dressing</b> to the bowl of <b>chopped lettuce</b>. Toss to thoroughly coat. Season with salt and pepper to taste."
            },
            {
                "title": "Assemble the sandwich & serve your dish",
                "content": "Evenly top the <b>baked focaccia</b> bottom with the <b>parmesan cheese</b>. Complete with the focaccia top. Using a serrated knife, cut the finished sandwich into 4 equal-sized pieces. Serve with the <b>salad</b> on the side. Enjoy!"
            }
        ]
    },
    {
        "title": "Broccoli & Mozzarella Calzones",
        "subtitle": "with Caesar Salad",
        "description": "These calzones are loaded with melty fresh mozzarella, creamy ricotta, and tender broccoli—balanced by a tangy tomato dipping sauce. For a refreshing side, weʼre tossing crunchy romaine and briny black olives in our take on Caesar dressing.",
        "ingredients": [
            "1 1/2 lbs Pizza Dough",
            "3 cloves Garlic",
            "1 Romaine Lettuce Heart",
            "1 lb Broccoli",
            "1 cup Part-Skim Ricotta Cheese",
            "1 8-Ounce Can Tomato Sauce",
            "1/2 lb Fresh Mozzarella Cheese",
            "1/4 cup Grated Parmesan Cheese",
            "2 oz Black Cerignola Olives",
            "1 Tbsp Italian Seasoning (Whole Dried Basil, Sage, Oregano, Savory, Rosemary, Thyme, & Marjoram)",
            "1 Lemon"
        ],
        "kitchen_tools": {
            "name": "Olive Wood Spoon by Eddington",
            "description": "Stir some old-world charm into your next meal with this sturdy spoon made from Italian-grown olive wood. For home cooks and professional chefs alike, this multi-purpose 14” blunt-end spoon is a must-have item. Stain and odor resistant, this spoon will not scratch porcelain, ceramic, glass, or enamel surfaces, and wonʼt heat up while you stir. Each unique olive wood spoon brings a sense of quality and professionalism to even the simplest tasks, like stirring sauce or deglazing a pan."
        },
        "steps": [
            {
                "title": "Prepare the ingredients",
                "content": "Remove the <b>dough</b> from the refrigerator to bring to room temperature. Place an oven rack in the center of the oven, then preheat to 475°F. Wash and dry the fresh produce. Cut off and discard the bottom 1/2 inch of the <b>broccoli</b> stem, then roughly chop the broccoli. Peel and roughly chop the <b>garlic</b>. Tear the <b>mozzarella cheese</b> into small pieces. Quarter and deseed the <b>lemon</b>."
            },
            {
                "title": "Cook the broccoli & make the filling",
                "content": "In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the <b>chopped broccoli</b>; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until lightly browned. Add <b>2/3 of the chopped garlic</b>. Cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add <b>1/4 cup of water</b>; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until the broccoli has softened and the water has cooked off. Transfer to a large bowl. Add the <b>mozzarella cheese, ricotta cheese, half the Italian seasoning,</b> and <b>the juice of 1 lemon wedge</b>; stir to combine. Season with salt and pepper. Wipe out the pan."
            },
            {
                "title": "Assemble & bake the calzones",
                "content": "Lightly oil a sheet pan. Divide the <b>dough</b> into 2 equal-sized portions; using your hands and a rolling pin (or wine bottle), gently stretch and roll the portions into ¼-inch-thick rounds. (If the dough is resistant, let rest for 5 minutes.) Divide the <b>filling</b> between the centers of the rounds; fold each round in half over the filling. Using a fork, crimp the edges of the dough to seal. Transfer to the sheet pan. Using a fork, poke a few holes across the tops of the calzones to vent. Lightly drizzle the calzones with olive oil. Bake 16 to 18 minutes, or until golden brown. Transfer to a cutting board and let stand for at least 2 minutes."
            },
            {
                "title": "Prepare the remaining ingredients",
                "content": "While the calzones bake, using the flat side of your knife, smash the <b>olives</b>; remove and discard the pits, then roughly chop. Cut off and discard the root end of the <b>lettuce</b>; roughly chop the leaves. To make the dressing, in a large bowl, combine the <b>mayonnaise, half the parmesan cheese, the juice of the remaining lemon wedges</b>, and a drizzle of olive oil. Season with salt and pepper to taste."
            },
            {
                "title": null,
                "content": "While the calzones continue to bake, in the pan used to cook the broccoli, heat 2 teaspoons of olive oil on medium-high until hot. Add the <b>remaining chopped garlic</b>; cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the <b>tomato sauce</b> and <b>remaining Italian seasoning</b>. Cook, stirring frequently, 2 to 3 minutes, or until slightly thickened. Turn off the heat and season with salt and pepper to taste."
            },
            {
                "title": "Make the salad & serve your dish",
                "content": "Just before serving, add the <b>chopped olives and lettuce</b> to the bowl of <b>dressing</b>. Toss to coat; season with salt and pepper to taste. Cut the <b>baked calzones</b> in half. Serve with the <b>sauce</b> and salad on the side. Garnish with the <b>remaining parmesan cheese</b>. Enjoy!"
            }
        ]
    },
    {
        "title": "Bucatini Alfredo",
        "subtitle": "with Broccoli",
        "description": "This quick-cooking recipe captures all the deliciously creamy, rich flavor of the classic Italian-American sauce—with the welcome addition of quick-braised broccoli. A dusting of pecorino cheese completes each bowl with a touch of sharpness.",
        "ingredients": [
            "2 Tbsps Crème Fraîche",
            "1/4 tsp Crushed Red Pepper Flakes",
            "3 Tbsps All-Purpose Flour",
            "1/4 cup Grated Pecorino Cheese"
        ],
        "kitchen_tools": {
            "name": "Stainless Steel Strainer",
            "description": "A stainless steel strainer is a handy tool for quinoa. It's great for draining grains and pastas (not to mention small fruits and vegetables after washing) and straining stocks and gravy. Lightweight and sturdy, itʼs constructed with a double-fine mesh."
        },
        "steps": [
            {
                "title": "Prepare the ingredients",
                "content": "Heat a large pot of salted water to boiling on high. Wash and dry the fresh produce. Cut off and discard the bottom 1/2 inch of the <b>broccoli</b> stem; cut the broccoli into small pieces, keeping the florets intact. Peel and finely chop the <b>garlic</b>."
            },
            {
                "title": "Cook the broccoli",
                "content": "In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the <b>broccoli pieces</b>; season with salt and pepper. Cook, stirring occasionally, 4 to 5 minutes, or until slightly softened. Add <b>1/2 cup of water</b>; season with salt and pepper. Cover the pan with aluminum foil and cook 3 to 4 minutes, or until the broccoli has softened and the water has cooked off. Transfer to a bowl. Wipe out the pan."
            },
            {
                "title": null,
                "content": "While the broccoli cooks, add the <b>pasta</b> to the pot of boiling water and cook 8 to 10 minutes, or until al dente (still slightly firm to the bite). Reserving <b>1/2 cup of the pasta cooking water</b>, drain thoroughly."
            },
            {
                "title": null,
                "content": "In the same pan, heat 1 1/2 tablespoons of olive oil on medium-high until hot. Add the <b>chopped garlic</b>; season with salt and pepper. Cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the <b>flour</b> and <b>as much of the red pepper flakes as you’d like</b>, depending on how spicy you’d like the dish to be. Cook, stirring constantly, 30 seconds to 1 minute, or until thoroughly combined. Add the <b>heavy cream </b>(shaking the bottle just before opening)<b>, verjus,</b> and <b>1 1/4 cups of water</b>; season with salt and pepper. Cook, whisking frequently, 2 to 3 minutes, or until thickened; season with salt and pepper to taste."
            },
            {
                "title": "Finish & serve your dish",
                "content": "Add the <b>cooked pasta, cooked broccoli, crème fraîche,</b> and <b>half the reserved pasta cooking water</b> to the pan. Cook, stirring vigorously, 30 seconds to 1 minute, or until the pasta is thoroughly coated. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Turn off the heat and season with salt and pepper to taste. Garnish the finished pasta with the <b>cheese</b>; season with pepper. Enjoy!"
            }
        ]
    },
    {
        "title": "Bucatini & Tomato Sauce",
        "subtitle": "with Roasted Broccoli",
        "description": "Made with petite datterini tomatoes, the sauce for tonightʼs bucatini highlights briny olives and capers, hot red pepper flakes, and savory Grana Padano cheese. Weʼre mixing in roasted broccoli for contrasting texture and nutty-sweet flavor.",
        "ingredients": [
            "6 oz Bucatini Pasta",
            "1 14-Ounce Can Datterini Tomatoes",
            "2 cloves Garlic",
            "2 Tbsps Butter",
            "1 Tbsp Capers",
            "1 lb Broccoli",
            "3/4 oz Grana Padano Cheese",
            "1 oz Kalamata Olives",
            "1/4 tsp Crushed Red Pepper Flakes",
            "1 Tbsp Italian Seasoning (Whole Dried Basil, Sage, Oregano, Savory, Rosemary, Thyme, & Marjoram)"
        ],
        "kitchen_tools": {
            "name": "Stainless Steel Strainer",
            "description": "A stainless steel strainer is a handy tool for quinoa. It's great for draining grains and pastas (not to mention small fruits and vegetables after washing) and straining stocks and gravy. Lightweight and sturdy, itʼs constructed with a double-fine mesh."
        },
        "steps": [
            {
                "title": "Prepare & roast the broccoli",
                "content": "Place an oven rack in the center of the oven, then preheat to 450°F. Heat a large pot of salted water to boiling on high. Wash and dry the fresh produce. Cut off and discard the bottom 1/2 inch of the <b>broccoli</b> stem; cut the broccoli into small pieces. Place on a sheet pan. Drizzle with olive oil and season with salt, pepper, and <b>up to half the Italian seasoning</b> (you will have extra); toss to coat. Arrange in an even layer. Roast 22 to 24 minutes, or until browned and tender when pierced with a fork. Remove from the oven."
            },
            {
                "title": "Prepare the remaining ingredients",
                "content": "While the broccoli roasts, peel and roughly chop the <b>garlic</b>. Using the flat side of your knife, smash the <b>olives</b>; remove and discard the pits, then roughly chop. Grate the <b>cheese</b> on the small side of a box grater."
            },
            {
                "title": null,
                "content": "While the broccoli continues to roast, add the <b>pasta</b> to the pot of boiling water and cook 8 to 10 minutes, or until al dente (still slightly firm to the bite). Turn off the heat. Reserving <b>1/2 cup of the pasta cooking water</b>, drain thoroughly and return to the pot."
            },
            {
                "title": null,
                "content": "While the pasta cooks, in a medium pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the <b>chopped garlic, capers,</b> and <b>as much of the red pepper flakes as you’d like</b>, depending on how spicy you’d like the dish to be; season with salt and pepper. Cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the <b>tomatoes</b> and <b>chopped olives</b>; season with salt and pepper. Cook, stirring occasionally and gently crushing the tomatoes with the back of a spoon, 6 to 7 minutes, or until thickened. Turn off the heat and season with salt and pepper to taste."
            },
            {
                "title": "Finish & serve your dish",
                "content": "To the pot of <b>cooked pasta</b>, add the <b>roasted broccoli, sauce, butter, half the grated cheese,</b> and <b>half the reserved pasta cooking water</b>; season with salt and pepper. Cook on medium-high, stirring vigorously, 1 to 2 minutes, or until the pasta is thoroughly coated. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Turn off the heat and season with salt and pepper to taste. Garnish the finished pasta with the <b>remaining grated cheese</b>. Enjoy!"
            }
        ]
    },
    {
        "title": "Cheesy Enchiladas Rojas",
        "subtitle": "with Mushrooms & Kale",
        "description": "Our hearty vegetarian enchiladas are filled with a combination of fragrant, Mexican-spiced rice and sautéed mushrooms and kale. For even more flavor, weʼre baking them under a smoky-sweet tomato sauce flavored with ancho chile paste and a layer of melty white cheddar. A dollop of lime-seasoned sour cream adds creamy, cooling balance. (You may receive green curly, dark green lacinato, or red kale.)",
        "ingredients": [
            "8 Flour Tortillas",
            "3/4 cup Jasmine Rice",
            "1 28-Ounce Can Whole Peeled Tomatoes",
            "4 oz Cremini Mushrooms",
            "3 cloves Garlic",
            "1 Yellow Onion",
            "1 bunch Chives",
            "2 Tbsps Ancho Chile Paste",
            "1 Tbsp Mexican Spice Blend (Ancho Chile Powder, Sweet Paprika, Garlic Powder, Ground Cumin, & Whole Mexican Oregano)",
            "1/2 lb White Cheddar Cheese",
            "1/2 cup Sour Cream"
        ],
        "kitchen_tools": {
            "name": "Box Grater",
            "description": "This sturdy tool offers four grater sizes, a comfortable grip, and a design thatʼs easy to clean. Whether carrots or cheddar, rutabaga or gouda, this box grater shreds everything from root veggies to cheese with ease. Simple and sturdy, the stainless steel grater features four precision-cut surfaces that yield coarse, medium, fine, and super fine textures; thereʼs also a slicing edge. Its easy-grip handle allows for efficient, comfortable work and its straight-edged base wonʼt collect stray bits, making for quicker clean up."
        },
        "steps": [
            {
                "title": null,
                "content": "Place an oven rack in the center of the oven, then preheat to 450°F. In a medium pot, combine the <b>rice, half the spice blend, a big pinch of salt,</b> and <b>1 1/2 cups of water</b>. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Turn off the heat and fluff with a fork. Transfer to a large bowl and set aside in a warm place."
            },
            {
                "title": "Prepare the ingredients & make the lime sour cream",
                "content": "While the rice cooks, wash and dry the fresh produce. Thinly slice the <b>mushrooms</b>. Remove and discard the stems of the kale; roughly chop the leaves. Peel and roughly chop the <b>garlic</b>. Peel and thinly slice the <b>onion</b>. Place the <b>tomatoes</b> in a bowl; gently break apart with your hands. Grate the <b>cheese</b> on the large side of a box grater. Thinly slice the <b>chives</b>. Halve the <b>lime</b> crosswise. In a bowl, combine the <b>sour cream, the juice of 1 lime half</b>, and a drizzle of olive oil; season with salt and pepper to taste."
            },
            {
                "title": "Cook the vegetables & start the filling",
                "content": "In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the <b>sliced mushrooms</b> in an even layer. Cook, without stirring, 2 to 3 minutes, or until lightly browned. Add the <b>chopped kale</b> and <b>1/2 cup of water</b>; season with salt and pepper. Cook, stirring frequently, 4 to 5 minutes, or until the kale has wilted and the water has cooked off. Transfer to the bowl of <b>cooked rice</b>; stir to combine. Wipe out the pan."
            },
            {
                "title": null,
                "content": "In the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the <b>chopped garlic</b> and <b>sliced onion</b>; season with salt and pepper. Cook, stirring frequently, 4 to 5 minutes, or until softened. Add the <b>chile paste</b> and <b>remaining spice blend</b>; cook, stirring constantly, 30 seconds to 1 minute, or until dark red and fragrant. Add the <b>tomatoes</b>; season with salt and pepper. Cook, stirring frequently, 6 to 7 minutes, or until thickened. Turn off the heat. Season with salt and pepper to taste."
            },
            {
                "title": "Finish the filling & assemble the enchiladas",
                "content": "Add <b>half the cheese</b> and <b>the juice of the remaining lime half</b> to the bowl of <b>filling</b>. Stir to combine; season with salt and pepper to taste. Place the <b>tortillas</b> on a work surface. Spread about <b>half the sauce</b> into the bottom of a baking dish. Divide the finished filling among the tortillas; tightly roll up each tortilla around the filling. Transfer to the baking dish in a single layer, seam side down. Evenly top with the <b>remaining sauce</b> and <b>remaining cheese</b>."
            },
            {
                "title": "Bake the enchiladas & serve your dish",
                "content": "Bake the <b>enchiladas</b> 10 to 12 minutes, or until the cheese has melted. Remove from the oven and let stand for at least 2 minutes. Garnish with the <b>sliced chives</b>. Serve with the <b>lime sour cream</b>. Enjoy!"
            }
        ]
    },
    {
        "title": "Crispy Fish Sandwiches",
        "subtitle": "with Tartar Sauce & Roasted Sweet Potato Wedges",
        "description": "These sandwiches highlight wild Alaskan pollock—flavored with aromatic seasonings, coated with panko breadcrumbs, and pan-fried for a golden-brown crust. In classic fashion, a tangy, mayo-based tartar sauce perfectly balances the fish.",
        "ingredients": [
            "21 oz Wild Alaskan Pollock Fillets",
            "2 Cage-Free Farm Eggs",
            "2 Tbsps Sweet Pickle Relish",
            "1 Romaine Lettuce Heart",
            "1 Tbsp Weeknight Hero Spice Blend (Garlic Powder, Onion Powder, Smoked Paprika, & Whole Dried Parsley)",
            "1 1/4 cups Panko Breadcrumbs",
            "1/4 cup Creamy Mustard Sauce"
        ],
        "kitchen_tools": {
            "name": "Slotted Spatula",
            "description": "Master your flipping skills with this commercial-grade slotted turner. This spatula is designed for delicate fish, but we use this versatile tool for anything that requires a deft hand for tricky flipping, such as over-easy eggs, paper-thin crepes or even a burger. With its low-angled beveled edge and flexible blade, this turner slips easily between the pan and your dinner, ensuring even the most delicate meal remains in picture-perfect condition."
        },
        "steps": [
            {
                "title": "Prepare & roast the sweet potatoes",
                "content": "Place an oven rack in the center of the oven, then preheat to 450°F. Wash and dry the fresh produce. Cut the <b>sweet potatoes</b> lengthwise into 1-inch-wide wedges. Place on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer, skin side down. Roast 27 to 29 minutes, or until browned and tender when pierced with a fork. Reserving the sheet pan, transfer to a plate and set aside in a warm place."
            },
            {
                "title": "Prepare the remaining ingredients & make the sauce",
                "content": "While the sweet potatoes roast, cut off and discard the root end of the <b>lettuce</b>; thinly slice the leaves. Halve the <b>rolls</b>. In a bowl, combine the <b>mayonnaise, creamy mustard sauce,</b> and <b>sweet pickle relish</b>. Season with salt and pepper to taste. Pat the <b>fish fillets</b> dry with paper towels. Halve crosswise."
            },
            {
                "title": null,
                "content": "While the sweet potatoes continue to roast, season the <b>halved fish fillets</b> on both sides with salt, pepper, and the <b>spice blend</b>. Crack the <b>eggs</b> into a bowl; season with salt and pepper. Beat until smooth. Place the <b>breadcrumbs</b> on a plate; season with salt and pepper. Working one piece at a time, thoroughly coat the seasoned fillets in the beaten eggs (letting any excess drip off), then in the breadcrumbs (pressing to adhere). Transfer to a separate plate."
            },
            {
                "title": null,
                "content": "While the sweet potatoes continue to roast, in a large pan (nonstick, if you have one), heat a thin layer of oil on medium-high until hot. Once the oil is hot enough that a pinch of breadcrumbs sizzles immediately when added, working in batches if necessary, add the <b>breaded fish fillets</b>. Cook 2 to 3 minutes per side, or until browned and cooked through. (If the pan seems dry, add 1 teaspoon of olive oil before flipping.) Transfer to a paper towel-lined plate; immediately season with salt and pepper."
            },
            {
                "title": null,
                "content": "While the fish cooks, place the <b>rolls</b> on the same sheet pan, cut side up. Drizzle with olive oil. Toast in the oven 4 to 5 minutes, or until lightly browned. Transfer to a clean work surface."
            },
            {
                "title": "Assemble the sandwiches & serve your dish",
                "content": "Divide the <b>sauce, cooked fish fillets,</b> and <b>sliced lettuce</b> among the <b>toasted rolls</b>. Serve the sandwiches with the <b>roasted sweet potatoes</b> on the side. Enjoy!"
            }
        ]
    },
    {
        "title": "",
        "subtitle": "",
        "description": "",
        "ingredients": [
            ""
        ],
        "kitchen_tools": {
            "name": "",
            "description": ""
        },
        "steps": [
            {
                "title": null,
                "content": ""
            }
        ]
    },
    {
        "title": "",
        "subtitle": "",
        "description": "",
        "ingredients": [
            ""
        ],
        "kitchen_tools": {
            "name": "",
            "description": ""
        },
        "steps": [
            {
                "title": null,
                "content": ""
            }
        ]
    },
    {
        "title": "",
        "subtitle": "",
        "description": "",
        "ingredients": [
            ""
        ],
        "kitchen_tools": {
            "name": "",
            "description": ""
        },
        "steps": [
            {
                "title": null,
                "content": ""
            }
        ]
    },
    {
        "title": "",
        "subtitle": "",
        "description": "",
        "ingredients": [
            ""
        ],
        "kitchen_tools": {
            "name": "",
            "description": ""
        },
        "steps": [
            {
                "title": null,
                "content": ""
            }
        ]
    },
    {
        "title": "",
        "subtitle": "",
        "description": "",
        "ingredients": [
            ""
        ],
        "kitchen_tools": {
            "name": "",
            "description": ""
        },
        "steps": [
            {
                "title": null,
                "content": ""
            }
        ]
    }
]
